
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Перем Запрос;
	СтандартнаяОбработка = Ложь;
	
	// Да, жесть, но я же извращенец
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Параметры.Вставить("Ссылка", Данные.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Родитель КАК НачалоДуги,
	|	Задачи.Ссылка КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины1
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Родитель <> ЗНАЧЕНИЕ(Справочник.Задачи.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Задачи.Ссылка,
	|	Задачи.Ссылка
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины2
	|ИЗ
	|	ЗамыканияДлины1 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины1 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины4
	|ИЗ
	|	ЗамыканияДлины2 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины2 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины8
	|ИЗ
	|	ЗамыканияДлины4 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины4 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины16
	|ИЗ
	|	ЗамыканияДлины8 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины8 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерваяДуга.НачалоДуги КАК НачалоДуги,
	|	ВтораяДуга.КонецДуги КАК КонецДуги
	|ПОМЕСТИТЬ ЗамыканияДлины32
	|ИЗ
	|	ЗамыканияДлины16 КАК ПерваяДуга
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины16 КАК ВтораяДуга
	|		ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Замыкания.КонецДуги КАК КонецДуги,
	|	КОЛИЧЕСТВО(Замыкания.НачалоДуги) КАК Уровень,
	|	Замыкания.КонецДуги.КодПроекта КАК КодПроекта
	|ПОМЕСТИТЬ втБлижайшийКодПроекта
	|ИЗ
	|	ЗамыканияДлины32 КАК Замыкания
	|ГДЕ
	|	Замыкания.КонецДуги.КодПроекта <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	Замыкания.КонецДуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗамыканияДлины32.КонецДуги КАК КонецДуги,
	|	втБлижайшийКодПроекта.Уровень КАК Уровень,
	|	втБлижайшийКодПроекта.КодПроекта КАК КодПроекта
	|ИЗ
	|	ЗамыканияДлины32 КАК ЗамыканияДлины32
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втБлижайшийКодПроекта КАК втБлижайшийКодПроекта
	|		ПО ЗамыканияДлины32.НачалоДуги = втБлижайшийКодПроекта.КонецДуги
	|ГДЕ
	|	ЗамыканияДлины32.КонецДуги = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уровень УБЫВ"
	;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Представление = 
		  СтрШаблон(
		    "%1%2", 
			?(Выборка.КодПроекта = "", "", стрШаблон("[%1] ", Выборка.КодПроекта)),
		    Данные.Наименование
		  );
	  Иначе
		  СтандартнаяОбработка = Истина;
	  КонецЕсли;
КонецПроцедуры
