
#Область ПрограммныйИнтерфейс
#Область Типизация
Функция ИнициализироватьТаблицуТаймлогов() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Тикет", Новый ОписаниеТипов("СправочникСсылка.Тикеты"));
	Результат.Колонки.Добавить("СсылкаНаТаймлог", Метаданные.Документы.ЛУРВ.ТабличныеЧасти.ОтчетЗаДень.Реквизиты.СсылкаНаТаймлог.Тип);
	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Длительность", Новый ОписаниеТипов("Число"));
	
	Возврат Результат;
КонецФункции
#КонецОбласти // Типизация
#КонецОбласти //ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти //СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти //СлужебныеПроцедурыИФункции
