////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля> 
// -<Описание модуля>
//
// Например:
// Клиентские процедуры и функции общего назначения:
// - для работы со списками в формах;
// - для работы с журналом регистрации;
// - для обработки действий пользователя в процессе редактирования
//   многострочного текста, например комментария в документах;
// - прочее.
//
////////////////////////////////////////////////////////////////////////////////

#Область Переменные
Перем ИнтеграцияGitlab;
#КонецОбласти // Переменные

#Область СлужебныйПрограммныйИнтерфейс
Процедура Инициализировать(СистемаТикетов) Экспорт
	// Эти извращенцы из БСП проверяют только существование некомандных подсистем, так что шли бы они далеко и надолго
	//Если ОбщегоНазначения.ПодсистемаСуществует("GitLabMirror") Тогда
		ИнтеграцияGitlab = Обработки.ИнтеграцияGitlab.СоздатьИнтеграцию(СистемаТикетов);
	//Иначе
	//	ВызватьИсключение СтрШаблон("Невозможно работать с таймлогами Gitlab без подсистемы Gitlab");
	//КонецЕсли;
	
КонецПроцедуры

Функция СобратьТаймлогиНаДату(Дата) Экспорт
	Если Ложь Тогда
		ИнтеграцияGitlab = Обработки.ИнтеграцияGitlab.Создать();
	КонецЕсли;
	
	Результат = УчетРабочегоВремени.ИнициализироватьТаблицуТаймлогов();
	//+++
	// 1. Подготовить запрос таймлогов на дату в GLQL
	
	// Точно работает
	
	//query MyTimelogsForDate {
	//  timelogs(
	//    startDate: "2026-08-13",   # начало дня (включительно)
	//    endDate: "2026-08-14"      # конец дня (не включая)
	//    username: "Neumoichev_D"  # можно указать своё имя, но необязательно
	//  ) {
	//    nodes {
	//      id
	//      timeSpent               # время в секундах
	//      spentAt                 # дата и время списания
	//      summary                 # комментарий
	//      issue {
	//        title
	//        iid
	//        id
	//        webUrl
	//      }
	//      mergeRequest {
	//        title
	//        iid
	//        webUrl
	//      }
	//    }
	//    pageInfo {                # для пагинации
	//      hasNextPage
	//      endCursor
	//    }
	//  }
	//}	
	// кандидат с переменными
//{
//  "query": "query GetMyTimelogs($startDate: String!, $endDate: String!) { currentUser { timelogs(startDate: $startDate, endDate: $endDate) { nodes { spentAt timeSpent summary issue { title iid } mergeRequest { title iid } user { username } } } } }",
//  "variables": {
//    "startDate": "2026-09-01",
//    "endDate": "2026-09-01"
//  }
//}
	//+++ ЗАменить константные даты параметрами, и имя пользователя тоже
	ТекстЗапросаНаДату = 
	"
	|query MyTimelogsForDate {
	|  timelogs(
	|    startDate: ""2026-08-13"",   # начало дня (включительно)
	|    endDate: ""2026-08-14""      # конец дня (не включая)
	|    username: ""Neumoichev_D""  # можно указать своё имя, но необязательно
	|  ) {
	|    nodes {
	|      id
	|      timeSpent               # время в секундах
	|      spentAt                 # дата и время списания
	|      summary                 # комментарий
	|      issue {
	|        title
	|        iid
	|        id
	|        webUrl
	|      }
	|      mergeRequest {
	|        title
	|        iid
	|        webUrl
	|      }
	|    }
	|    pageInfo {                # для пагинации
	|      hasNextPage
	|      endCursor
	|    }
	|  }
	|}
	|";
	Параметры = Новый Структура("startDate,endDate", Дата, Дата); 
	// 2. Вызвать запрос через обработку интеграции
	ИнтеграцияGitlab.ВыполнитьGraphQLЗапрос(ТекстЗапросаНаДату, Новый Структура);
	// 3. Преобразовать результат в таблицу таймлогов
	Возврат Результат;
КонецФункции

#КонецОбласти //СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти //СлужебныеПроцедурыИФункции
