// Модуль-заглушка для перехвата вызовов КоннекторHTTP через Мокито
// См. https://bia-technologies.github.io/yaxunit/docs/features/mocking/mockito/
// Шаблон заимствованных методов: https://bia-technologies.github.io/yaxunit/docs/features/mocking/mockito/#шаблоны-заимствованных-методов

#Область ПерехватываемыеМетоды

&Вместо("Get")
Функция Мок_Get(URL, ПараметрыЗапроса = Неопределено, ДополнительныеПараметры = Неопределено, Сессия = Неопределено) Экспорт

	ПараметрыМетода = Мокито.МассивПараметров(URL, ПараметрыЗапроса, ДополнительныеПараметры, Сессия);
	ПрерватьВыполнение = Ложь;
	Результат = МокитоПерехват.АнализВызова(КоннекторHTTP, "Get", ПараметрыМетода, ПрерватьВыполнение);
	Если Не ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(URL, ПараметрыЗапроса, ДополнительныеПараметры, Сессия);
	Иначе
		Возврат Результат;
	КонецЕсли;

КонецФункции

#КонецОбласти