
#Область ПрограммныйИнтерфейс //Public
Функция КонтролируемыеРеквизиты() Экспорт
	Перем Рез;
	Рез = Новый Массив;
	// Да, можно через метаданные по ресурсам, но лениво
	Рез.Добавить("Решена");
	Рез.Добавить("Срок");
	Рез.Добавить("КодПроекта");
	Рез.Добавить("ПометкаУдаления");
	Рез.Добавить("Родитель");
	Возврат Рез;
КонецФункции


#КонецОбласти //ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс //Internal
// Код процедур и функций
#КонецОбласти //СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции //Private
// Код процедур и функций
#КонецОбласти //СлужебныеПроцедурыИФункции
