
&НаСервере
Процедура ПолучитьДанныеПоДатеНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	об.КомандаПолучитьТаймлогиПоДате(Об.After);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоДате(Команда)
	ПолучитьДанныеПоДатеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеСДатыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеСДаты(Команда)
	ПолучитьДанныеСДатыНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьТекущуюЗаписьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТекущуюЗапись(Команда)
	СоздатьТекущуюЗаписьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьТекущуюЗаписьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТекущуюЗапись(Команда)
	УдалитьТекущуюЗаписьНаСервере();
КонецПроцедуры
