
// https://its.1c.ru/db/v8std#content:455:hdoc
// 1.6. Шаблон оформления разделов для модулей форм:
//    Раздел «Обработчики событий формы» содержит процедуры-обработчики событий формы: ПриСозданииНаСервере, ПриОткрытии и т.п.
//    Раздел «Обработчики событий элементов шапки формы» содержит процедуры-обработчики элементов, расположенных в основной части формы (все, что не связано с таблицами на форме).
//    В разделах «Обработчики событий элементов таблицы формы <имя таблицы формы>» размещаются процедуры-обработчики таблиц формы и элементов таблиц. 
//    Для процедур-обработчиков каждой таблицы должен быть создан свой раздел.
//    Раздел «Обработчики команд формы» содержит процедуры-обработчики команд формы (имена которых задаются в свойстве Действие команд формы).
//    Раздел «Служебные процедуры и функции» имеет такое же предназначение, что и в общих модулях. 
//    См. также: Правила создания модулей форм [https://its.1c.ru/db/content/v8std/src/1%C2%A0100/700/i8100630.htm?_=1570634134]



#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти // Обработчики Событий Формы

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОтчетЗаДень
// Туду: здесь запоминаем прошлые значения переменных в строке, если надо 

&НаКлиенте
Процедура ОтчетЗаДеньПередНачаломИзменения(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтчетЗаДеньПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

// Туду: здесь меняем окончание прошлой строки на "за секунду до начала" текущей, обновляем длительность прошлой строки
&НаКлиенте
Процедура ОтчетЗаДеньНачалоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

// Туду: здесь меняем окончание прошлой строки на за секунду до начало следующей Ну и длительность предыдущей Или просто пересчитываем всю таблицу
&НаКлиенте
Процедура ОтчетЗаДеньПослеУдаления(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы

#Область ОбработчикиКомандФормы
// Туду: здесь срхраняя длительность текущей строки и предыдущей меняем их местами обновляя даты начала и окончания
// Код процедур и функций
&НаКлиенте
Процедура СтрокаВверх(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

// Туду: здесь для каждой строки с таймлогом обновляем его данные из учетной системы
// потом для каждой строки у которой длительность, комметаний, задача и дата не совпадают - даем команду на редактирование таймлога по данным 1С, перезаполняем таймлог новым ИД
// Для строк без ИД таймлога создаем записи таймлога.
// Вызовы должны идти через фасад логирования времени, все данные передавать пачкой, чтобы обработка логирования сама их отсортировала по системам.  Обратно фасад должен передать 
// полный комплект данных по таймлогу, включая статус синхронизации (успешно или не достучались)
&НаКлиенте
Процедура Синхронизировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

// Туду: здесь получить все таймлоги пользователя на дату для всех не архивных систем учета
// Потом провести синхронизацию сначала по ИД таймлога, потом по задаче, дате, длительности, комментарию. 
// Найденным ИД тайилога поставить признак синхронизации, не найденные добавить в конец документа, сохранив длительность 
// и заполнив даты начала окончания нарастающим итогом.  Учесть что для систем до которых не достучались статус должен стать серым, а не похеренным если вдруг ИД таймлога не нашелся.
// А если не нашелся существующий - сходить во внешнюю систему еще раз конкретно по ИД таймлога, проверить, не поменялась ли дата
&НаКлиенте
Процедура СобратьТаймлогиНаДату(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти // СлужебныеПроцедурыИФункции


