// https://its.1c.ru/db/v8std#content:455:hdoc
//1.5. Шаблон оформления разделов для модулей объектов, менеджеров, наборов записей, обработок, отчетов и т.п.:
//    Раздел «Программный интерфейс» содержит экспортные процедуры и функции, предназначенные для использования в других модулях конфигурации или другими программами (например, через внешнее соединение). Не следует в этот раздел помещать экспортные функции и процедуры, которые предназначены для вызова исключительно из модулей самого объекта, его форм и команд. Например, процедуры заполнения табличной части документа, которые вызываются из обработки заполнения в модуле объекта и из формы документа в обработчике команды формы не являются программным интерфейсом модуля объекта, т.к. вызываются только в самом модуле и из форм этого же объекта. Их следует размещать в разделе «Служебные процедуры и функции».
//    Раздел «Обработчики событий» содержит обработчики событий модуля объекта (ПриЗаписи, ПриПроведении и др.)
//    Раздел «Служебный программный интерфейс» имеет такое же предназначение, как и в общих модулях.
//    Раздел «Служебные процедуры и функции» имеет такое же предназначение, как и в общих модулях.

////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля> 
// -<Описание модуля>
//
// Например:
// Клиентские процедуры и функции общего назначения:
// - для работы со списками в формах;
// - для работы с журналом регистрации;
// - для обработки действий пользователя в процессе редактирования
//   многострочного текста, например комментария в документах;
// - прочее.
//
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс
// Туду: здесь получить все таймлоги пользователя на дату для всех не архивных систем учета
// Потом провести синхронизацию сначала по ИД таймлога, потом по задаче, дате, длительности, комментарию. 
// Найденным ИД тайилога поставить признак синхронизации, не найденные добавить в конец документа, сохранив длительность 
// и заполнив даты начала окончания нарастающим итогом.  Учесть что для систем до которых не достучались статус должен стать серым, а не похеренным если вдруг ИД таймлога не нашелся.
// А если не нашелся существующий - сходить во внешнюю систему еще раз конкретно по ИД таймлога, проверить, не поменялась ли дата
Процедура СобратьТаймлогиНаДату() Экспорт  
	// здесь получить все таймлоги пользователя на дату для всех не архивных систем учета
	ОбработкаИнтеграции = Обработки.УчетРабочегоВремениИнтеграции.Создать();
	ТаймлогиВнешнихСистем = ОбработкаИнтеграции.СобратьТаймлогиНаДату(НачалоРаботы);
	// Потом провести синхронизацию сначала по ИД таймлога, потом по задаче, дате, длительности, комментарию. 
	// Найденным ИД тайилога поставить признак синхронизации, не найденные добавить в конец документа, сохранив длительность 
	// и заполнив даты начала окончания нарастающим итогом.  Учесть что для систем до которых не достучались статус должен стать серым, а не похеренным если вдруг ИД таймлога не нашелся.
	// А если не нашелся существующий - сходить во внешнюю систему еще раз конкретно по ИД таймлога, проверить, не поменялась ли дата
	
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти // ОбработчикиСобытий

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти // СлужебныеПроцедурыИФункции
