&НаКлиенте
Перем ПредТекущаяЗадача;

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.грСтруктура Тогда
		// Считаем, что перешли из туду
		ЗадачаИзТуду = Элементы.ТудуСписок.ТекущаяСтрока;
		Если ЗадачаИзТуду <> Неопределено Тогда
			Элементы.Список.ТекущаяСтрока = ЗадачаИзТуду;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СменаТекущейЗадачи() Экспорт 
	ТекущаяЗадача = ПредТекущаяЗадача;
	//ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПриАктивизацииСтроки(Элемент)
	ПредТекущаяЗадача = Элемент.ТекущаяСтрока;
	ПодключитьОбработчикОжидания("СменаТекущейЗадачи", 0.1, Истина);
КонецПроцедуры
